jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/u-blox_structs.h
/*
 This is a library written for the u-blox ZED-F9P and NEO-M8P-2
 SparkFun sells these at its website: www.sparkfun.com
 Do you like this library? Help support SparkFun. Buy a board!
 https://www.sparkfun.com/products/16481
 https://www.sparkfun.com/products/15136
 https://www.sparkfun.com/products/15005
 https://www.sparkfun.com/products/15733
 https://www.sparkfun.com/products/15193
 https://www.sparkfun.com/products/15210

 Original version by Nathan Seidle @ SparkFun Electronics, September 6th, 2018
 v2.0 rework by Paul Clark @ SparkFun Electronics, December 31st, 2020

 This library handles configuring and handling the responses
 from a u-blox GPS module. Works with most modules from u-blox including
 the Zed-F9P, NEO-M8P-2, NEO-M9N, ZOE-M8Q, SAM-M8Q, and many others.

 https://github.com/sparkfun/SparkFun_Ublox_Arduino_Library

 Development environment specifics:
 Arduino IDE 1.8.13

 SparkFun code, firmware, and software is released under the MIT License(http://opensource.org/licenses/MIT).
 The MIT License (MIT)
 Copyright (c) 2016 SparkFun Electronics
 Permission is hereby granted, free of charge, to any person obtaining a copy of this software and
 associated documentation files (the "Software"), to deal in the Software without restriction,
 including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,
 and/or sell copies of the Software, and to permit persons to whom the Software is furnished to
 do so, subject to the following conditions:

 The above copyright notice and this permission notice shall be included in all copies or substantial
 portions of the Software.

 THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT
 NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

#ifndef __u_blox_structs_h__
#define __u_blox_structs_h__

#ifndef DEF_NUM_SENS
#define DEF_NUM_SENS 7 // The maximum number of ESF sensors
#endif

//Additional flags and pointers that need to be stored with each message type
struct ubxAutomaticFlags {
  union {
    uint8_t all;
    struct {
      uint8_t automatic :1; // Will this message be delivered and parsed "automatically" (without polling)
      uint8_t implicitUpdate :1; // Is the update triggered by accessing stale data (=true) or by a call to checkUblox (=false)
      uint8_t addToFileBuffer :1; // Should the raw UBX data be added to the file buffer?
      uint8_t callbackCopyValid :1; // Is the copy of the data struct used by the callback valid/fresh?
    } bits;
  } flags;
};

// UBX-NAV-POSECEF (0x01 0x01): Position solution in ECEF
const uint16_t UBX_NAV_POSECEF_LEN = 20;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  int32_t ecefX; // ECEF X coordinate: cm
  int32_t ecefY; // ECEF Y coordinate: cm
  int32_t ecefZ; // ECEF Z coordinate: cm
  uint32_t pAcc; // Position Accuracy Estimate: cm
} UBX_NAV_POSECEF_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t ecefX :1;
      uint32_t ecefY :1;
      uint32_t ecefZ :1;
      uint32_t pAcc :1;
    } bits;
  } moduleQueried;
} UBX_NAV_POSECEF_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_POSECEF_data_t data;
  UBX_NAV_POSECEF_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_POSECEF_data_t);
  UBX_NAV_POSECEF_data_t* callbackData;
} UBX_NAV_POSECEF_t;

// UBX-NAV-POSLLH (0x01 0x02): Geodetic position solution
const uint16_t UBX_NAV_POSLLH_LEN = 28;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  int32_t lon; // Longitude: Degrees * 1e-7
  int32_t lat; // Latitude: Degrees * 1e-7
  int32_t height; // Height above ellipsoid: mm
  int32_t hMSL; // Height above mean sea level: mm
  uint32_t hAcc; // Horizontal Accuracy Estimate: mm
  uint32_t vAcc; // Vertical Accuracy Estimate: mm
} UBX_NAV_POSLLH_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t lon :1;
      uint32_t lat :1;
      uint32_t height :1;
      uint32_t hMSL :1;
      uint32_t hAcc :1;
      uint32_t vAcc :1;
    } bits;
  } moduleQueried;
} UBX_NAV_POSLLH_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_POSLLH_data_t data;
  UBX_NAV_POSLLH_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_POSLLH_data_t);
  UBX_NAV_POSLLH_data_t* callbackData;
} UBX_NAV_POSLLH_t;

// UBX-NAV-STATUS (0x01 0x03): Receiver navigation status
const uint16_t UBX_NAV_STATUS_LEN = 16;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint8_t gpsFix; // GPSfix Type: 0x00 = no fix; 0x01 = dead reckoning only; 0x02 = 2D-fix; 0x03 = 3D-fix
                  // 0x04 = GPS + dead reckoning combined; 0x05 = Time only fix; 0x06..0xff = reserved
  union {
    uint8_t all;
    struct {
      uint8_t gpsFixOk :1; // 1 = position and velocity valid and within DOP and ACC Masks.
      uint8_t diffSoln :1; // 1 = differential corrections were applied
      uint8_t wknSet :1; // 1 = Week Number valid (see Time Validity section for details)
      uint8_t towSet :1; // 1 = Time of Week valid (see Time Validity section for details)
    } bits;
  } flags;
  union {
    uint8_t all;
    struct {
      uint8_t diffCorr :1; // 1 = differential corrections available
      uint8_t carrSolnValid :1; // 1 = valid carrSoln
      uint8_t reserved :4;
      uint8_t mapMatching :2; // map matching status: 00: none
                              // 01: valid but not used, i.e. map matching data was received, but was too old
                              // 10: valid and used, map matching data was applied
                              // 11: valid and used, map matching data was applied.
    } bits;
  } fixStat;
  union {
    uint8_t all;
    struct {
      uint8_t psmState :2; // power save mode state
                           // 0: ACQUISITION [or when psm disabled]
                           // 1: TRACKING
                           // 2: POWER OPTIMIZED TRACKING
                           // 3: INACTIVE
      uint8_t reserved1 :1;
      uint8_t spoofDetState :2; // Spoofing detection state
                                // 0: Unknown or deactivated
                                // 1: No spoofing indicated
                                // 2: Spoofing indicated
                                // 3: Multiple spoofing indications
      uint8_t reserved2 :1;
      uint8_t carrSoln :2; // Carrier phase range solution status:
                           // 0: no carrier phase range solution
                           // 1: carrier phase range solution with floating ambiguities
                           // 2: carrier phase range solution with fixed ambiguities
    } bits;
  } flags2;
  uint32_t ttff; // Time to first fix (millisecond time tag): ms
  uint32_t msss; // Milliseconds since Startup / Reset: ms
} UBX_NAV_STATUS_data_t;

