jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/u-blox_structs.h
typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t gpsFix :1;

      uint32_t gpsFixOk :1;
      uint32_t diffSoln :1;
      uint32_t wknSet :1;
      uint32_t towSet :1;

      uint32_t diffCorr :1;
      uint32_t carrSolnValid :1;
      uint32_t mapMatching :1;

      uint32_t psmState :1;
      uint32_t spoofDetState :1;
      uint32_t carrSoln :1;

      uint32_t ttff :1;
      uint32_t msss :1;
    } bits;
  } moduleQueried;
} UBX_NAV_STATUS_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_STATUS_data_t data;
  UBX_NAV_STATUS_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_STATUS_data_t);
  UBX_NAV_STATUS_data_t* callbackData;
} UBX_NAV_STATUS_t;

// UBX-NAV-DOP (0x01 0x04): Dilution of precision
const uint16_t UBX_NAV_DOP_LEN = 18;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint16_t gDOP; // Geometric DOP: * 0.01
  uint16_t pDOP; // Position DOP: * 0.01
  uint16_t tDOP; // Time DOP: * 0.01
  uint16_t vDOP; // Vertical DOP: * 0.01
  uint16_t hDOP; // Horizontal DOP: * 0.01
  uint16_t nDOP; // Northing DOP: * 0.01
  uint16_t eDOP; // Easting DOP: * 0.01
} UBX_NAV_DOP_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t gDOP :1;
      uint32_t pDOP :1;
      uint32_t tDOP :1;
      uint32_t vDOP :1;
      uint32_t hDOP :1;
      uint32_t nDOP :1;
      uint32_t eDOP :1;
    } bits;
  } moduleQueried;
} UBX_NAV_DOP_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_DOP_data_t data;
  UBX_NAV_DOP_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_DOP_data_t);
  UBX_NAV_DOP_data_t* callbackData;
} UBX_NAV_DOP_t;

// UBX-NAV-ATT (0x01 0x05): Attitude solution
const uint16_t UBX_NAV_ATT_LEN = 32;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint8_t version; // Message version (0x00 for this version)
  uint8_t reserved1[3];
  int32_t roll; // Vehicle roll: Degrees * 1e-5
  int32_t pitch; // Vehicle pitch: Degrees * 1e-5
  int32_t heading; // Vehicle heading: Degrees * 1e-5
  uint32_t accRoll; // Vehicle roll accuracy (if null, roll angle is not available): Degrees * 1e-5
  uint32_t accPitch; // Vehicle pitch accuracy (if null, roll angle is not available): Degrees * 1e-5
  uint32_t accHeading; // Vehicle heading accuracy (if null, roll angle is not available): Degrees * 1e-5
} UBX_NAV_ATT_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t version :1;
      uint32_t roll :1;
      uint32_t pitch :1;
      uint32_t heading :1;
      uint32_t accRoll :1;
      uint32_t accPitch :1;
      uint32_t accHeading :1;
    } bits;
  } moduleQueried;
} UBX_NAV_ATT_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_ATT_data_t data;
  UBX_NAV_ATT_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_ATT_data_t);
  UBX_NAV_ATT_data_t* callbackData;
} UBX_NAV_ATT_t;

// UBX-NAV-PVT (0x01 0x07): Navigation position velocity time solution
const uint16_t UBX_NAV_PVT_LEN = 92;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint16_t year; // Year (UTC)
  uint8_t month; // Month, range 1..12 (UTC)
  uint8_t day; // Day of month, range 1..31 (UTC)
  uint8_t hour; // Hour of day, range 0..23 (UTC)
  uint8_t min; // Minute of hour, range 0..59 (UTC)
  uint8_t sec; // Seconds of minute, range 0..60 (UTC)
  union {
    uint8_t all;
    struct {
      uint8_t validDate :1; // 1 = valid UTC Date
      uint8_t validTime :1; // 1 = valid UTC time of day
      uint8_t fullyResolved :1; // 1 = UTC time of day has been fully resolved (no seconds uncertainty).
      uint8_t validMag :1; // 1 = valid magnetic declination
    } bits;
  } valid;
  uint32_t tAcc; // Time accuracy estimate (UTC): ns
  int32_t nano; // Fraction of second, range -1e9 .. 1e9 (UTC): ns
  uint8_t fixType; // GNSSfix Type:
                   // 0: no fix
                   // 1: dead reckoning only
                   // 2: 2D-fix
                   // 3: 3D-fix
                   // 4: GNSS + dead reckoning combined
                   // 5: time only fix
  union {
    uint8_t all;
    struct {
      uint8_t gnssFixOK :1; // 1 = valid fix (i.e within DOP & accuracy masks)
      uint8_t diffSoln :1; // 1 = differential corrections were applied
      uint8_t psmState :3;
      uint8_t headVehValid :1; // 1 = heading of vehicle is valid, only set if the receiver is in sensor fusion mode
      uint8_t carrSoln :2; // Carrier phase range solution status:
                           // 0: no carrier phase range solution
                           // 1: carrier phase range solution with floating ambiguities
                           // 2: carrier phase range solution with fixed ambiguities
    } bits;
  } flags;
  union {
    uint8_t all;
    struct {
      uint8_t reserved :5;
      uint8_t confirmedAvai :1; // 1 = information about UTC Date and Time of Day validity confirmation is available
      uint8_t confirmedDate :1; // 1 = UTC Date validity could be confirmed
      uint8_t confirmedTime :1; // 1 = UTC Time of Day could be confirmed
    } bits;
  } flags2;
  uint8_t numSV; // Number of satellites used in Nav Solution
  int32_t lon; // Longitude: deg * 1e-7
  int32_t lat; // Latitude: deg * 1e-7
  int32_t height; // Height above ellipsoid: mm
  int32_t hMSL; // Height above mean sea level: mm
  uint32_t hAcc; // Horizontal accuracy estimate: mm
  uint32_t vAcc; // Vertical accuracy estimate: mm
  int32_t velN; // NED north velocity: mm/s
  int32_t velE; // NED east velocity: mm/s
  int32_t velD; // NED down velocity: mm/s
  int32_t gSpeed; // Ground Speed (2-D): mm/s
  int32_t headMot; // Heading of motion (2-D): deg * 1e-5
  uint32_t sAcc; // Speed accuracy estimate: mm/s
  uint32_t headAcc; // Heading accuracy estimate (both motion and vehicle): deg * 1e-5
  uint16_t pDOP; // Position DOP * 0.01
  union {
    uint8_t all;
    struct {
      uint8_t invalidLlh :1; // 1 = Invalid lon, lat, height and hMSL
    } bits;
  } flags3;
  uint8_t reserved1[5];
  int32_t headVeh; // Heading of vehicle (2-D): deg * 1e-5
  int16_t magDec; // Magnetic declination: deg * 1e-2
  uint16_t magAcc; // Magnetic declination accuracy: deg * 1e-2
} UBX_NAV_PVT_data_t;

