jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/u-blox_structs.h
typedef struct {
  uint8_t version; // Message version (0x00 for this version)
  uint8_t reserved1[2];
  union {
    uint8_t all;
    struct {
      uint8_t invalidLlh :1; // 1 = Invalid lon, lat, height, hMSL, lonHp, latHp, heightHp and hMSLHp
    } bits;
  } flags;
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  int32_t lon; // Longitude: deg * 1e-7
  int32_t lat; // Latitude: deg * 1e-7
  int32_t height; // Height above ellipsoid: mm
  int32_t hMSL; // Height above mean sea level: mm
  int8_t lonHp; // High precision component of longitude: deg * 1e-9
  int8_t latHp; // High precision component of latitude: deg * 1e-9
  int8_t heightHp; // High precision component of height above ellipsoid: mm * 0.1
  int8_t hMSLHp; // High precision component of height above mean sea level: mm * 0.1
  uint32_t hAcc; // Horizontal accuracy estimate: mm * 0.1
  uint32_t vAcc; // Vertical accuracy estimate: mm * 0.1
} UBX_NAV_HPPOSLLH_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t version :1;

      uint32_t invalidLlh :1;

      uint32_t iTOW :1;
      uint32_t lon :1;
      uint32_t lat :1;
      uint32_t height :1;
      uint32_t hMSL :1;
      uint32_t lonHp :1;
      uint32_t latHp :1;
      uint32_t heightHp :1;
      uint32_t hMSLHp :1;
      uint32_t hAcc :1;
      uint32_t vAcc :1;
    } bits;
  } moduleQueried;
} UBX_NAV_HPPOSLLH_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_HPPOSLLH_data_t data;
  UBX_NAV_HPPOSLLH_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_HPPOSLLH_data_t);
  UBX_NAV_HPPOSLLH_data_t* callbackData;
} UBX_NAV_HPPOSLLH_t;

// UBX-NAV-TIMEUTC (0x01 0x21): UTC time solution
const uint16_t UBX_NAV_TIMEUTC_LEN = 20;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint32_t tAcc; // Time accuracy estimate (UTC): ns
  int32_t nano; // Fraction of second, range -1e9 .. 1e9 (UTC): ns
  uint16_t year; // Year (UTC)
  uint8_t month; // Month, range 1..12 (UTC)
  uint8_t day; // Day of month, range 1..31 (UTC)
  uint8_t hour; // Hour of day, range 0..23 (UTC)
  uint8_t min; // Minute of hour, range 0..59 (UTC)
  uint8_t sec; // Seconds of minute, range 0..60 (UTC)
  union {
    uint8_t all;
    struct {
      uint8_t validTOW :1; // 1 = Valid Time of Week
      uint8_t validWKN :1; // 1 = Valid Week Number
      uint8_t validUTC :1; // 1 = Valid UTC Time
      uint8_t reserved :1;
      uint8_t utcStandard :4; // UTC standard identifier
    } bits;
  } valid;
} UBX_NAV_TIMEUTC_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t tAcc :1;
      uint32_t nano :1;
      uint32_t year :1;
      uint32_t month :1;
      uint32_t day :1;
      uint32_t hour :1;
      uint32_t min :1;
      uint32_t sec :1;

      uint32_t validTOW :1;
      uint32_t validWKN :1;
      uint32_t validUTC :1;
      uint32_t utcStandard :1;
    } bits;
  } moduleQueried;
} UBX_NAV_TIMEUTC_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_TIMEUTC_data_t data;
  UBX_NAV_TIMEUTC_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_TIMEUTC_data_t);
  UBX_NAV_TIMEUTC_data_t* callbackData;
} UBX_NAV_TIMEUTC_t;

// UBX-NAV-CLOCK (0x01 0x22): Clock solution
const uint16_t UBX_NAV_CLOCK_LEN = 20;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  int32_t clkB; // Clock bias: ns
  int32_t clkD; // Clock drift: ns/s
  uint32_t tAcc; // Time accuracy estimate: ns
  uint32_t fAcc; // Frequency accuracy estimate: ps/s
} UBX_NAV_CLOCK_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t clkB :1;
      uint32_t clkD :1;
      uint32_t tAcc :1;
      uint32_t fAcc :1;
    } bits;
  } moduleQueried;
} UBX_NAV_CLOCK_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_CLOCK_data_t data;
  UBX_NAV_CLOCK_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_CLOCK_data_t);
  UBX_NAV_CLOCK_data_t* callbackData;
} UBX_NAV_CLOCK_t;

// UBX-NAV-TIMELS (0x01 0x26): Leap second event information
const uint16_t UBX_NAV_TIMELS_LEN = 24;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint8_t version; // Message version (0x00 for this version)
  uint8_t reserved1[3];
  uint8_t srcOfCurrLs; //Information source for the current number of leap seconds
  int8_t currLs; //Current number of leap seconds since start of GPS (Jan 6, 1980), s
  uint8_t srcOfLsChange; //Information source for the future leap second event
  int8_t lsChange; //Future leap second change if one is scheduled, +1, 0, -1s
  int32_t timeToLsEvent; //Num of secs until the next or from the last leap second, s
  uint16_t dateOfLsGpsWn; //GPS week num (WN) of the next or the last leap second event
  uint16_t dateOfLsGpsDn; //GPS day of week num (DN) for the next or last leap second event
  uint8_t reserved2[3];
  union {
    uint8_t all;
    struct {
      uint8_t validCurrLs :1; // 1 = Valid current number of leap seconds value
      uint8_t validTimeToLsEvent :1; // 1 = Valid time to next leap second event or from the last leap second event if no future event scheduled
    } bits;
  } valid;
} UBX_NAV_TIMELS_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t version :1;
      uint32_t srcOfCurrLs :1;
      uint32_t currLs :1;
      uint32_t srcOfLsChange :1;
      uint32_t lsChange :1;
      uint32_t timeToLsEvent :1;
      uint32_t dateOfLsGpsWn :1;
      uint32_t dateOfLsGpsDn :1;
      uint32_t validCurrLs :1;
      uint32_t validTimeToLsEvent :1;
    } bits;
  } moduleQueried;
} UBX_NAV_TIMELS_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_TIMELS_data_t data;
  UBX_NAV_TIMELS_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_NAV_TIMELS_data_t);
  UBX_NAV_TIMELS_data_t* callbackData;
} UBX_NAV_TIMELS_t;

