jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/u-blox_structs.h
typedef struct {
  uint8_t gnssId; // GNSS identifier
  uint8_t svId; // Satellite identifier
  uint8_t reserved1;
  uint8_t freqId; // GLONASS frequency slot
  uint8_t numWords; // The number of data words contained in this message (0..16)
  uint8_t chn; // The tracking channel number the message was received on
  uint8_t version; // Message version (0x01 for this version)
  uint8_t reserved2;
  uint32_t dwrd[UBX_RXM_SFRBX_MAX_WORDS]; // The data words
} UBX_RXM_SFRBX_data_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_RXM_SFRBX_data_t data;
  bool moduleQueried;
  void (*callbackPointer)(UBX_RXM_SFRBX_data_t);
  UBX_RXM_SFRBX_data_t* callbackData;
} UBX_RXM_SFRBX_t;

// UBX-RXM-RAWX (0x02 0x15): Multi-GNSS raw measurement data
// Note: length is variable
const uint8_t UBX_RXM_RAWX_MAX_BLOCKS = 64; // GUESS! TO DO: find the correct value for this
const uint16_t UBX_RXM_RAWX_MAX_LEN = 16 + (32 * UBX_RXM_RAWX_MAX_BLOCKS);

typedef struct {
  uint8_t rcvTow[8]; // Measurement time of week in receiver local time [64-bit float]
  uint16_t week; // GPS week number
  int8_t leapS; // GPS leap seconds
  uint8_t numMeas; // Number of measurements to follow
  union {
    uint8_t all;
    struct {
      uint8_t leapSec :1; // Leap seconds have been determined
      uint8_t clkReset :1; // Clock reset applied
    } bits;
  } recStat;
  uint8_t version; // Message version (0x01 for this version)
  uint8_t reserved1[2];
} UBX_RXM_RAWX_header_t;

typedef struct {
  uint8_t prMes[8]; // Pseudorange measurement: m [64-bit float]
  uint8_t cpMes[8]; // Carrier phase measurement: cycles [64-bit float]
  uint8_t doMes[4]; // Doppler measurement: Hz [32-bit float]
  uint8_t gnssId; // GNSS identifier
  uint8_t svId; // Satellite identifier
  uint8_t sigId; // New signal identifier
  uint8_t freqId; // GLONASS frequency slot
  uint16_t lockTime; // Carrier phase locktime counter: ms
  uint8_t cno; // Carrier-to-noise density ratio: dB-Hz
  uint8_t prStdev; // Estimated pseudorange measurement standard deviation: m * 0.01 * 2^n [4-bit]
  uint8_t cpStdev; // Estimated carrier phase measurement standard deviation: cycles * 0.004 [4-bit]
  uint8_t doStdev; // Estimated Doppler measurement standard deviation: Hz * 0.002 * 2^n [4-bit]
  union {
    uint8_t all;
    struct {
      uint8_t prValid :1; // Pseudorange valid
      uint8_t cpValid :1; // Carrier phase valid
      uint8_t halfCyc :1; // Half cycle valid
      uint8_t subHalfCyc :1; // Half cycle subtracted from phase
    } bits;
  } trkStat;
  uint8_t reserved2;
} UBX_RXM_RAWX_block_t;

typedef struct {
  UBX_RXM_RAWX_header_t header;
  UBX_RXM_RAWX_block_t blocks[UBX_RXM_RAWX_MAX_BLOCKS];
} UBX_RXM_RAWX_data_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_RXM_RAWX_data_t data;
  bool moduleQueried;
  void (*callbackPointer)(UBX_RXM_RAWX_data_t);
  UBX_RXM_RAWX_data_t* callbackData;
} UBX_RXM_RAWX_t;

// CFG-specific structs

// UBX-CFG-RATE (0x06 0x08): Navigation/measurement rate settings
const uint16_t UBX_CFG_RATE_LEN = 6;

typedef struct {
  uint16_t measRate; // The elapsed time between GNSS measurements, which defines the rate: ms
  uint16_t navRate; // The ratio between the number of measurements and the number of navigation solutions: cycles
  uint16_t timeRef; // The time system to which measurements are aligned: 0: UTC; 1: GPS; 2: GLONASS; 3: BeiDou; 4: Galileo
} UBX_CFG_RATE_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t measRate :1;
      uint32_t navRate :1;
      uint32_t timeRef :1;
    } bits;
  } moduleQueried;
} UBX_CFG_RATE_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_CFG_RATE_data_t data;
  UBX_CFG_RATE_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_CFG_RATE_data_t);
  UBX_CFG_RATE_data_t* callbackData;
} UBX_CFG_RATE_t;

// TIM-specific structs

// UBX-TIM-TM2 (0x0D 0x03): Time mark data
const uint16_t UBX_TIM_TM2_LEN = 28;

typedef struct {
  uint8_t ch; // Channel (i.e. EXTINT) upon which the pulse was measured
  union {
    uint8_t all;
    struct {
      uint8_t mode :1; // 0=single; 1=running
      uint8_t run :1; // 0=armed; 1=stopped
      uint8_t newFallingEdge :1; // New falling edge detected
      uint8_t timeBase :2; // 0=Time base is Receiver time; 1=Time base is GNSS time; 2=Time base is UTC
      uint8_t utc :1; // 0=UTC not available; 1=UTC available
      uint8_t time :1; // 0=Time is not valid; 1=Time is valid (Valid GNSS fix)
      uint8_t newRisingEdge :1; // New rising edge detected
    } bits;
  } flags;
  uint16_t count; // Rising edge counter
  uint16_t wnR; // Week number of last rising edge
  uint16_t wnF; // Week number of last falling edge
  uint32_t towMsR; // TOW of rising edge: ms
  uint32_t towSubMsR; // Millisecond fraction of tow of rising edge: ns
  uint32_t towMsF; // TOW of falling edge: ms
  uint32_t towSubMsF; // Millisecond fraction of tow of falling edge: ns
  uint32_t accEst; // Accuracy estimate: ns
} UBX_TIM_TM2_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t ch :1;
      uint32_t mode :1;
      uint32_t run :1;
      uint32_t newFallingEdge :1;
      uint32_t timeBase :1;
      uint32_t utc :1;
      uint32_t time :1;
      uint32_t newRisingEdge :1;

      uint32_t count :1;
      uint32_t wnR :1;
      uint32_t wnF :1;
      uint32_t towMsR :1;
      uint32_t towSubMsR :1;
      uint32_t towMsF :1;
      uint32_t towSubMsF :1;
      uint32_t accEst :1;
    } bits;
  } moduleQueried;
} UBX_TIM_TM2_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_TIM_TM2_data_t data;
  UBX_TIM_TM2_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_TIM_TM2_data_t);
  UBX_TIM_TM2_data_t* callbackData;
} UBX_TIM_TM2_t;

// ESF-specific structs

// UBX-ESF-ALG (0x10 0x14): IMU alignment information
const uint16_t UBX_ESF_ALG_LEN = 16;

typedef struct {
  uint32_t iTOW; // GPS time of week of the HNR epoch: ms
  uint8_t version; // Message version (0x01 for this version)
  union {
    uint8_t all;
    struct {
      uint8_t autoMntAlgOn :1; // Automatic IMU-mount alignment on/off bit
      uint8_t status :3; // Status of the IMU-mount alignment
                         //   0: user-defined/fixed angles are used
                         //   1: IMU-mount roll/pitch angles alignment is ongoing
                         //   2: IMU-mount roll/pitch/yaw angles alignment is ongoing
                         //   3: coarse IMU-mount alignment are used
                         //   4: fine IMU-mount alignment are used
    } bits;
  } flags;
  union {
    uint8_t all;
    struct {
      uint8_t tiltAlgError :1; // IMU-mount tilt (roll and/or pitch) alignment error (0: no error, 1: error)
      uint8_t yawAlgError :1; // IMU-mount yaw alignment error (0: no error, 1: error)
      uint8_t angleError :1; // IMU-mount misalignment Euler angle singularity error (0: no error, 1: error)
    } bits;
  } error;
  uint8_t reserved1;
  uint32_t yaw; // IMU-mount yaw angle [0, 360]: Degrees * 1e-2
  int16_t pitch; // IMU-mount pitch angle [-90, 90]: Degrees * 1e-2
  int16_t roll; // IMU-mount roll angle [-180, 180]: Degrees * 1e-2
} UBX_ESF_ALG_data_t;

