jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/u-blox_structs.h
typedef struct {
  uint32_t iTOW; // GPS time of week of the HNR epoch: ms
  uint8_t version; // Message version (0x02 for this version)
  uint8_t reserved1[7];
  uint8_t fusionMode; // Fusion mode:
                      //  0: Initialization mode: receiver is initializing some unknown values required for doing sensor fusion
                      //  1: Fusion mode: GNSS and sensor data are used for navigation solution computation
                      //  2: Suspended fusion mode: sensor fusion is temporarily disabled due to e.g. invalid sensor data or detected ferry
                      //  3: Disabled fusion mode: sensor fusion is permanently disabled until receiver reset due e.g. to sensor error
  uint8_t reserved2[2];
  uint8_t numSens; // Number of sensors
  UBX_ESF_STATUS_sensorStatus_t status[DEF_NUM_SENS];
} UBX_ESF_STATUS_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t version :1;
      uint32_t fusionMode :1;
      uint32_t numSens :1;

      uint32_t status : DEF_NUM_SENS;
    } bits;
  } moduleQueried;
} UBX_ESF_STATUS_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_ESF_STATUS_data_t data;
  UBX_ESF_STATUS_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_ESF_STATUS_data_t);
  UBX_ESF_STATUS_data_t* callbackData;
} UBX_ESF_STATUS_t;

// HNR-specific structs

// UBX-HNR-PVT (0x28 0x00): High rate output of PVT solution
const uint16_t UBX_HNR_PVT_LEN = 72;

typedef struct {
  uint32_t iTOW; // GPS time of week of the HNR epoch: ms
  uint16_t year; // Year (UTC)
  uint8_t month; // Month, range 1..12 (UTC)
  uint8_t day; // Day of month, range 1..31 (UTC)
  uint8_t hour; // Hour of day, range 0..23 (UTC)
  uint8_t min; // Minute of hour, range 0..59 (UTC)
  uint8_t sec; // Seconds of minute, range 0..60 (UTC)
  union {
    uint8_t all;
    struct {
      uint8_t validDate :1; // 1 = Valid UTC Date
      uint8_t validTime :1; // 1 = Valid UTC Time of Day
      uint8_t fullyResolved :1; // 1 = UTC Time of Day has been fully resolved
    } bits;
  } valid;
  int32_t nano; // Fraction of second (UTC): ns
  uint8_t gpsFix; // GPSfix Type, range 0..5
                  // 0x00 = No Fix
                  // 0x01 = Dead Reckoning only
                  // 0x02 = 2D-Fix
                  // 0x03 = 3D-Fix
                  // 0x04 = GPS + dead reckoning combined
                  // 0x05 = Time only fix
                  // 0x06..0xff: reserved
  union {
    uint8_t all;
    struct {
      uint8_t gpsFixOK :1; // >1 = Fix within limits (e.g. DOP & accuracy)
      uint8_t diffSoln :1; // 1 = DGPS used
      uint8_t WKNSET :1; // 1 = Valid GPS week number
      uint8_t TOWSET :1; // 1 = Valid GPS time of week (iTOW & fTOW)
      uint8_t headVehValid :1; // 1= Heading of vehicle is valid
    } bits;
  } flags;
  uint8_t reserved1[2];
  int32_t lon; // Longitude: Degrees * 1e-7
  int32_t lat; // Latitude: Degrees * 1e-7
  int32_t height; // Height above ellipsoid: mm
  int32_t hMSL; // Height above MSL: mm
  int32_t gSpeed; // Ground Speed (2-D): mm/s
  int32_t speed; // Speed (3-D): mm/s
  int32_t headMot; // Heading of motion (2-D): Degrees * 1e-5
  int32_t headVeh; // Heading of vehicle (2-D): Degrees * 1e-5
  uint32_t hAcc; // Horizontal accuracy: mm
  uint32_t vAcc; // Vertical accuracy: mm
  uint32_t sAcc; // Speed accuracy: mm/s
  uint32_t headAcc; // Heading accuracy: Degrees * 1e-5
  uint8_t reserved2[4];
} UBX_HNR_PVT_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t year :1;
      uint32_t month :1;
      uint32_t day :1;
      uint32_t hour :1;
      uint32_t min :1;
      uint32_t sec :1;

      uint32_t validDate :1;
      uint32_t validTime :1;
      uint32_t fullyResolved :1;

      uint32_t nano :1;
      uint32_t gpsFix :1;

      uint32_t gpsFixOK :1;
      uint32_t diffSoln :1;
      uint32_t WKNSET :1;
      uint32_t TOWSET :1;
      uint32_t headVehValid :1;

      uint32_t lon :1;
      uint32_t lat :1;
      uint32_t height :1;
      uint32_t hMSL :1;
      uint32_t gSpeed :1;
      uint32_t speed :1;
      uint32_t headMot :1;
      uint32_t headVeh :1;
      uint32_t hAcc :1;
      uint32_t vAcc :1;
      uint32_t sAcc :1;
      uint32_t headAcc :1;
    } bits;
  } moduleQueried;
} UBX_HNR_PVT_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_HNR_PVT_data_t data;
  UBX_HNR_PVT_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_HNR_PVT_data_t);
  UBX_HNR_PVT_data_t* callbackData;
} UBX_HNR_PVT_t;

// UBX-HNR-ATT (0x28 0x01): Attitude solution
const uint16_t UBX_HNR_ATT_LEN = 32;

typedef struct {
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint8_t version;
  uint8_t reserved1[3];
  int32_t roll; // Vehicle roll: Degrees * 1e-5
  int32_t pitch; // Vehicle pitch: Degrees * 1e-5
  int32_t heading; // Vehicle heading: Degrees * 1e-5
  uint32_t accRoll; // Vehicle roll accuracy: Degrees * 1e-5
  uint32_t accPitch; // Vehicle pitch accuracy: Degrees * 1e-5
  uint32_t accHeading; // Vehicle heading accuracy: Degrees * 1e-5
} UBX_HNR_ATT_data_t;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t all :1;

      uint32_t iTOW :1;
      uint32_t version :1;
      uint32_t roll :1;
      uint32_t pitch :1;
      uint32_t heading :1;
      uint32_t accRoll :1;
      uint32_t accPitch :1;
      uint32_t accHeading :1;
    } bits;
  } moduleQueried;
} UBX_HNR_ATT_moduleQueried_t;

typedef struct {
  ubxAutomaticFlags automaticFlags;
  UBX_HNR_ATT_data_t data;
  UBX_HNR_ATT_moduleQueried_t moduleQueried;
  void (*callbackPointer)(UBX_HNR_ATT_data_t);
  UBX_HNR_ATT_data_t* callbackData;
} UBX_HNR_ATT_t;

// UBX-HNR-INS (0x28 0x02): Vehicle dynamics information
const uint16_t UBX_HNR_INS_LEN = 36;

typedef struct {
  union {
    uint32_t all;
    struct {
      uint32_t version :8; // Message version (0x00 for this version)
      uint32_t xAngRateValid :1; // Compensated x-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t yAngRateValid :1; // Compensated y-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t zAngRateValid :1; // Compensated z-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t xAccelValid :1; // Compensated x-axis acceleration data validity flag (0: not valid, 1: valid)
      uint32_t yAccelValid :1; // Compensated y-axis acceleration data validity flag (0: not valid, 1: valid)
      uint32_t zAccelValid :1; // Compensated z-axis acceleration data validity flag (0: not valid, 1: valid)
    } bits;
  } bitfield0;
  uint8_t reserved1[4];
  uint32_t iTOW; // GPS time of week of the HNR epoch: ms
  int32_t xAngRate; // Compensated x-axis angular rate: Degrees/s * 1e-3
  int32_t yAngRate; // Compensated y-axis angular rate: Degrees/s * 1e-3
  int32_t zAngRate; // Compensated z-axis angular rate: Degrees/s * 1e-3
  int32_t xAccel; // Compensated x-axis acceleration (with gravity): m/s^2 * 1e-2
  int32_t yAccel; // Compensated y-axis acceleration (with gravity): m/s^2 * 1e-2
  int32_t zAccel; // Compensated z-axis acceleration (with gravity): m/s^2 * 1e-2
} UBX_HNR_INS_data_t;

